{
    "https://www.bbc.co.uk/news/technology-52391759": {
        "title": "Apple iPhone at risk of hacking through email app",
        "date": "24 April 2020",
        "content": "A flaw in Apple's mobile operating system may have left millions of iPhone and iPad users vulnerable to hackers.Research published by ZecOps, a mobile security firm, said a bug in the Mail app made devices susceptible to sophisticated attacks. The firm said it had high confidence the bug has been used to exploited at least six high-profile victims.An Apple spokesperson told Reuters a fix would be included in upcoming software updates.  In a statement, Apple said: We have thoroughly investigated the researcher's report and, based on the information provided, have concluded these issues do not pose an immediate risk to our users. The researcher identified three issues in Mail, but alone they are insufficient to bypass iPhone and iPad security protections, and we have found no evidence they were used against customers.ZecOps reported the bug to Apple in March. The tech giant had not previously known about the issue.To exploit this flaw, hackers would send a seemingly blank message to an iPhone or iPad users Mail account - the email app on iOS devices. When the email was opened it would crash the app forcing the user to reboot. During the reboot, hackers would be able to access information on the device.What makes this attack different from other hacks is users do not need to download any external software or visit a website that contains malicious software (malware). Typically hacks require some action on the part of the victim - those steps make possible to trace the origin of the attack.The researchers said the bug could be exploited even on recent versions of iOS.ZecOps claimed it had found evidence that the bug was used to attack well-known targets including individuals from a Fortune 500 company in North America, an executive from a mobile carrier in Japan, employees of technology companies in Saudi Arabia and Israel, a European journalist and an individual in Germany. The firm would not disclose the identities of the victims.  Apple products are typically considered to be more secure than other mobile devices. Experts say this shows how difficult it can be to spot underlying vulnerabilities.The company said: These potential issues will be addressed in a software update soon. We value our collaboration with security researchers to help keep our users safe and will be crediting the researcher for their assistanceThe UK carried out 122,000 coronavirus tests on the last day of April, passing its target, government says."
    },
    "https://www.bbc.co.uk/programmes/l0026gz3": {
        "title": "BBC Homepage",
        "date": "not found",
        "content": "Eve tries to rebuild her life, having been shot and left for dead in Rome by Villanelle.Five teams set off from Mexico City in a race to reach Ushuaia in Argentina.Computer whiz Sergei fails to return from new job, alarming girlfriend Lily.James Delaney returns to London to claim a mysterious legacy left to him by his father.Georgie makes a professional decision with unexpected emotional consequences."
    },
    "https://www.bbc.co.uk/news/technology-52289375": {
        "title": "Apple announces new iPhone SE to target mid-range market",
        "date": "15 April 2020",
        "content": "Apple has announced a new iPhone SE, reviving a mid-market brand it had discontinued in 2018.It resembles the form of 2017's iPhone 8 with a 4.7in screen, and a fingerprint ID sensor but not a depth camera for facial recognition.It is powered by the same processor as the flagship iPhone 11 Pro, but lacks multiple rear cameras.The handset costs the same as the original SE in the US, but is more expensive in other markets.The iPhone SE is priced at $399 in the US and £419 in the UK.One analyst said that having a mid-range phone again could help Apple compete for new customers against rivals such as Samsung and Google, which have a strong presence in that market sector.Once you buy an iPhone you are more likely to buy another one, said Dan Iver from Wedbush Securities. Despite Covid-19 causing lower demand, smartphone makers continue to release models. Earlier this week, OnePlus unveiled new models, and last month Huawei launched its flagship P40 range.In February, Apple warned that the coronavirus lockdown in China would impact iPhone production and lower sales.Physical stores, including Apple's, remain closed in many countries.But Mr Iver expects the phone to sell between 20 million and 25 million units in the first six to nine months. Apple's hands are almost being forced to bring this out because from a supply chain perspective it was ready, he said.But he added that while competitors might be similarly priced, Apple is this golden brand.The device supports wireless charging. Its rear-facing camera's resolution is 12 megapixels and can still create background blur in portrait photos, despite lacking a second lens. The selfie camera is 7MP.Mobile analyst Carolina Milanesi also said Apple's brand appeal would help it in this price range.The second-hand market is pretty vibrant for Apple so are there users who have never have a new iPhone that will want one, and can afford it at this price, said the Creative Strategies consultant.But she also warned: I think the phone has to have some compromises. It can't be too close to the iPhone 11 or a iPhone XR - or what is the point? The UK carried out 122,000 coronavirus tests on the last day of April, passing its target, government says."
    },
    "https://www.bbc.co.uk/news/business-52495990": {
        "title": "Apple boosted by streaming services despite lockdown",
        "date": "30 April 2020",
        "content": "Apple saw growth for the first three months of the year, as falling device sales in China were offset by demand for its streaming services due to the coronavirus lockdown.Sales climbed to $58.3bn (£46.2bn), up from $58bn in the same period in 2019 and beating expectations of $54.5bn.Apple boss Tim Cook said the firm saw a record for streaming and phenomenal growth in the online store.Despite the coronavirus lockdown hurting iPhone supply due to Chinese factories closing, and a drop in demand for devices in China - a major market for Apple - during February and March, Mr Cook told investors in an earnings call on Thursday: I don't think I can remember a quarter where I've been prouder of Apple.Apple said iPhone sales for the quarter fell 7.2% to $28.9bn, compared to $31bn in the previous year. However, its wearables, home and accessories division - which produces the Apple Watch and AirPods - rose 22.5% to $6.3bn, while services - such as subscriptions to Apple Music and Apple TV - jumped 16.6% to $13.3bn like-for-like. Although business in China has not fully rebounded, Apple said all of its stores in the country had reopened by mid-March and sales were improving.Net income for the six months ending 28 March 2020 rose 6.2% to $33.5bn, up from $25.9bn in the same period in 2019.Mr Cook said Apple was in a strong position and that its supply chain was robust and back up and running at full-throttle at the end of March.While we can't say for certain how many chapters are in this book, we can be assured that the ending will be a good one, he told investors. Apple said it would not be issuing forecasts for the following quarter, given the ongoing uncertainties of the lockdown, which has seen its sales move online or to curb-side pick-ups. Research firm eMarketer's principal analyst Yoram Wurmser said Apple's performance was pretty solid.Growth of 1% in this environment is impressive, particularly given some of the extent of Apple's exposure to the earlier lockdowns in Asia, said Mr Wurmser.The biggest bright spot for Apple was services, which grew 17% year-over-year. As people spent more time on their phones while locked away at home, they clearly were spending more money in the App Store and on some of the subscription services offered by Apple, including Apple Music and Arcade.According to Sophie Lund-Yates, equity analyst at Hargreaves Lansdown, the rise in demand for wearables and services is an encouraging one for Apple, given recent lacklustre iPhone sales growth.Despite plenty of talk around services, Apple is still very much a hardware business. And even before coronavirus, conditions weren't perfect, she said.Ms Lund-Yates added that Apple's decision to price the new iPhone SE at half the cost of some of Apple's most recent models is a good way to convince customers to upgrade during the lockdown.The UK carried out 122,000 coronavirus tests on the last day of April, passing its target, government says."
    },
    "https://www.bbc.co.uk/news/uk-52481769": {
        "title": "Drive-through coronavirus test",
        "date": "1 May 2020",
        "content": "Private carer Heather Lamont shares her experience of self-administering a test for coronavirus.This video has been optimised for mobile viewing on the BBC News app. The BBC News app is available from the Apple App Store for iPhone and Google Play Store for Android."
    },
    "https://www.bbc.co.uk/programmes/w3cszmlx": {
        "title": "The first iPhone",
        "date": "not found",
        "content": "The touchscreen smartphone changed mobile technology for ever. It was unveiled by the Apple boss Steve Jobs in 2007.The touchscreen smartphone changed mobile technology for ever. It was unveiled on January 9th 2007 by the Apple boss Steve Jobs. Within a few years smartphones had changed the way billions of people lived their lives. Ashley Byrne has been speaking to Andy Grignon a senior developer on the project.(Photo: Steve Jobs at the iPhone launch in San Francisco in 2007. Credit: David Paul Morris/Getty Images)                                    Available now                                        See all episodes from Witness History        Looking back at almost six years of global conflict, from Hiroshima to the HolocaustFrom the Bolshevik takeover of 1917 to the break-up of the Soviet UnionThe communities, politics, leaders and events that have shaped Africa"
    },
    "https://www.bbc.co.uk/programmes/w3cszhnk": {
        "title": "Tech firms boosted by Covid-19",
        "date": "not found",
        "content": "In contrast to many businesses, will the tech giants emerge stronger from the crisis? Presented by Rory Cellan-Jones.In contrast to many businesses, will the tech giants emerge stronger from the crisis? Plus, the Eurovision song contest is off this year but we find out about a music competition to create a Eurovision-style hit using artificial intelligence. And in another of our series on using tech during the lockdown for new skills and hobbies, we look at podcasting. Presented by Rory Cellan-Jones, with BBC tech reporters David Molloy and Jane Wakefield. Produced by Jat Gill.(Image: A customer wearing a face mask tries out the latest iPhone SE at an Apple store in Hangzhou, China. Credit: Getty Images).                                    Available now                            Download and listen - Keep up to date with tech news and business with our podcastDebate, features and opinion on robotics and artificial intelligenceHow the technology business is transforming the way we live and work"
    },
    "https://www.bbc.co.uk/news/health-52490714": {
        "title": "Coronavirus: When your child's in intensive care with Covid-19",
        "date": "1 May 2020",
        "content": "Two mothers told the BBC about their experiences as their young children battled coronavirus.This video has been optimised for mobile viewing on the BBC News app. The BBC News app is available from the Apple App Store for iPhone and Google Play Store for Android."
    },
    "https://www.bbc.co.uk/news/world-us-canada-52498730": {
        "title": "Protesters storm state capitol building",
        "date": "1 May 2020",
        "content": "Hundreds of demonstrators, some of them armed, gathered in Lansing as legislators debated the extension of the state of emergency.This video has been optimised for mobile viewing on the BBC News app. The BBC News app is available from the Apple App Store for iPhone and Google Play Store for Android."
    },
    "https://www.bbc.co.uk/news/uk-52487951": {
        "title": "Captain Tom turns 100",
        "date": "30 April 2020",
        "content": "The war veteran who has raised more than £31m for the NHS celebrated his milestone birthday in style.This video has been optimised for mobile viewing on the BBC News app. The BBC News app is available from the Apple App Store for iPhone and Google Play Store for Android. "
    }
}