{
    "https://www.bbc.co.uk/programmes/b09yt35q": {
        "title": "Navy",
        "date": "fail",
        "main_body": "Rhod is joining the Navy, but that's not good news for a bloke who struggles with seasickness. As he's dunked in at the deep end with the rigorous Royal Navy training regime can he stay afloat?Rhod Gilbert is joining the Navy, but that's not good news for a bloke who struggles with seasickness. As he's dunked in at the deep end with the rigorous Royal Navy training regime can he stay afloat? For Rhod, it's all hands on deck for a chance to take the helm of one of Her Majesty's warships, but as he struggles with all the Navy know-how, he takes a crash course in marine navigation all too literally.            See all episodes from Rhod Gilbert's Work Experience        "
    },
    "https://www.bbc.co.uk/news/uk-england-devon-52464885": {
        "title": "Coronavirus: Royal Navy submarine lockdown party captain sacked",
        "date": "28 April 2020",
        "main_body": "The commander of a nuclear-powered submarine who allowed his crew to hold a barbecue party has been sacked.Cdr Jonathan Lewis, captain of hunter-killer submarine HMS Trenchant, allowed the party during the lockdown at Devonport dockyard in Plymouth.A video shared on social media showed the crew dancing and laughing on the dockside after the submarine returned to the city for repairs.The captain has been relieved of his command following a Royal Navy probe.Naval sources told the BBC that Cdr Lewis had been advised both by his senior officers on shore and some of his own officers on the submarine not to go ahead with the party.A senior defence source said it was one of a number of instances that had undermined trust and credibility in his command.Cdr Lewis will remain in the Royal Navy but will be assigned another role.The BBC is not responsible for the content of external Internet sitesBoris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/news/newsbeat-52455169": {
        "title": "US military shares UFO videos filmed by Navy officers",
        "date": "28 April 2020",
        "main_body": "The US Department of Defense (DoD) has released three videos that it says show evidence of unidentified flying objects. Yes, UFOs.Sections of the clips had been shared online before now, with people questioning if they were real. In an effort to clear up any misconceptions the DoD, who had previously confirmed the videos were filmed by the US Navy, has made all three clips public. It said the footage does not reveal any sensitive systems and does not impinge on any subsequent investigations.Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here."
    },
    "https://www.bbc.co.uk/programmes/b008fj41": {
        "title": "Celebrating Their Important Anniversary",
        "date": "fail",
        "main_body": "It's Troutbridge's 25th, and Pertwee plans some special commemorative gifts. With Richard Caldicot. From September 1967.The crew discover HMS Troutbridge has been afloat for 25 years, so Pertwee plans some special commemorative gifts... Stars Leslie Phillips as the Sub-Lieutenant, Jon Pertwee as the Chief Petty Officer, Stephen Murray as the Number One, Richard Caldicot as Captain Povey, Heather Chasen as Mrs Povey, Ronnie Barker as Commander Bell, Tenniel Evans as the Admiral and Michael Bates as the Padre.Laughs afloat aboard British Royal Navy frigate HMS Troutbridge. The Navy Lark ran for an impressive thirteen series between 1959 and 1976. First broadcast on the BBC Light Programme in September 1967."
    },
    "https://www.bbc.co.uk/news/uk-england-devon-52406342": {
        "title": "Coronavirus: Royal Navy submarine crew had lockdown party",
        "date": "23 April 2020",
        "main_body": "A submarine crew were filmed having a party during the coronavirus lockdown, prompting a Royal Navy investigation.The captain of HMS Trenchant, a nuclear-powered attack submarine based at Devonport in Plymouth, has been sent home on leave.Video of the crew enjoying a party and barbecue while the submarine was tied up have been shared on social media.It shows sailors dancing and laughing, and a source confirmed some were drinking alcohol.HMS Trenchant had been on patrol before having to return to Devonport to undergo repairs.The crew were required to stay with the submarine in isolation while the repairs were completed.BBC defence correspondent Jonathan Beale said it was understood the captain had gone ahead with the entertainment despite being advised it might be inappropriate.A Royal Navy spokesman said: An investigation is under way. It would be inappropriate to comment further.The BBC is not responsible for the content of external Internet sitesBoris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/programmes/b007k2xj": {
        "title": "Doing a Disastrical",
        "date": "fail",
        "main_body": "Will Phillips' pursuit of the new Wren in Captain Povey's office end happily ever after? With Heather Chasen. From July 1967.Will Phillips' pursuit of the new WREN in Captain Povey's office end happily ever after? Laughs afloat aboard British Royal Navy frigate HMS Troutbridge. The Navy Lark ran for an impressive 13 series between 1959 and 1976.The Sub-Lieutenant ...... Leslie PhillipsThe Chief Petty Officer ...... Jon PertweeThe Number One ...... Stephen MurrayCaptain Povey ...... Richard CaldicotSecond Officer McCluty, ...... Heather ChasenCaptain Hardcastle ...... Ronnie BarkerTaffy Goldstein ...... Tenniel EvansThe Padre....... Michael Bates"
    },
    "https://www.bbc.co.uk/news/world-middle-east-52348099": {
        "title": "Iran warns US Navy over Gulf incident",
        "date": "19 April 2020",
        "main_body": "Iran's Islamic Revolutionary Guard Corps (IRGC) has accused the US of giving a Hollywood version of events over an incident in the Gulf this week.The US said Iranian vessels had conducted harassing approaches of six of its ships on Wednesday.But the IRGC said it had increased patrols in the Gulf after the US Navy blocked the path of an Iranian ship earlier this month.Tensions rose after the US killed an Iranian general in Iraq in January.The IRGC's statement said that US forces had blocked one of its ships in two separate incidents in early April, using dangerous behaviour while ignoring warnings.It added that Iran would respond decisively to any miscalculation.The incident on Wednesday came a day after armed men - believed to have been IRGC personnel - seized a Hong Kong-flagged tanker in the Gulf of Oman and redirected it into Iranian waters before releasing it.The US Navy accused Iran's Islamic Revolution Guard Corps (IRGC) of dangerous and provocative actions against its vessels, which were involved in a military exercise with US Army Apache attack helicopters in international waters.  Eleven IRGC Navy vessels repeatedly approached of six US Navy and Coast Guard ships at extremely close range and high speeds on Wednesday, the US Navy said. One passed within 10 yards (9m) of a Coast Guard cutter.The US crews issued multiple warnings via bridge-to-bridge radio, five short blasts from the ships' horns and long-range acoustic noise maker devices, but received no response from the IRGCN.After approximately one hour, the IRGCN vessels responded to the bridge-to-bridge radio queries, then manoeuvred away from the US ships and opened distance between them, it added.The US Navy said such dangerous and provocative actions increased the risk of miscalculation and collision, and were not in accordance with international maritime conventions or customs. The relationship between the two countries has been fraught for decades. But tensions increased after the US withdrew from a nuclear deal and reimposed sanctions on Tehran.Last year, Iranian forces seized a British-flagged tanker in retaliation for the seizure of an Iranian tanker by the British territory of Gibraltar. Both vessels were eventually released.The US also accused Iran of carrying out attacks on six tankers in the Gulf of Oman and launching missiles and drones at two oil facilities in Saudi Arabia. Iran denied any involvement.Animosity between the two countries rose further in January, when the US killed a top IRGC general in a drone strike in Iraq. Iran responded by launching missiles at Iraqi military bases hosting US forces. Boris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/programmes/b007k2yc": {
        "title": "Have Been Redecorating",
        "date": "fail",
        "main_body": "Troutbridge needs a facelift preparation for the arrival of a new senior wren. Stars Leslie Phillips. From September 1967.HMS Troutbridge needs a facelift preparation for the arrival of a new senior wren. Stars Leslie Phillips as the Sub-Lieutenant, Jon Pertwee as the Chief Petty Officer, Stephen Murray as the Number One, Richard Caldicot as Captain Povey, Heather Chasen as Second Officer McCluty, Ronnie Barker as Commander Bell, Tenniel Evans as Uncle and Michael Bates as the Padre.Laughs afloat aboard British Royal Navy frigate HMS Troutbridge. The Navy Lark ran for an impressive thirteen series between 1959 and 1976. First broadcast on the BBC Light Programme in September 1967."
    },
    "https://www.bbc.co.uk/news/world-asia-india-52336001": {
        "title": "India coronavirus: Navy says 21 sailors test positive at key Mumbai base",
        "date": "18 April 2020",
        "main_body": "Indian defence officials have reported a coronavirus outbreak at a key naval base in the western city of Mumbai.Twenty-one personnel have tested positive for Covid-19 at INS Angre, which is the seat of the force's western command, the navy said in a statement on Saturday. It added that there are no infections aboard any ships or submarines.India has 11,906 active infections and 480 deaths, according to the latest data from the ministry of health.The Navy said that they had tested a number of personnel who had come into contact with a soldier who had tested positive earlier this month. Many of those who had tested positive for the virus, the statement added, were asymptomatic. All 21 personnel live in the same residential block, which has been declared a containment zone and has been placed under lockdown. In a video message to personnel last week, Navy Chief Admiral Karambir Singh stressed the importance of keeping ships and submarines free of the virus. The coronavirus pandemic is unprecedented and it has never been seen before. Its impact has been extraordinary across the globe, including India, he said.The navy has been playing an active role in India's response to the Covid-19 outbreak.It has set up isolation facilities to treat patients at one of its premier hospital units and is also running quarantine camps. The outbreak aboard the Indian naval base follows reports of outbreaks aboard vessels belonging to other nations. More than 500 sailors on the USS Roosevelt have tested positive for the virus and one of them died earlier this week. And nearly a third of the sailors serving with France's aircraft carrier Charles de Gaulle - 668 out of nearly 2,000 - have been infected with coronavirus.Boris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/news/world-middle-east-52308343": {
        "title": "US Navy accuses Iranian vessels of harassing warships in Gulf",
        "date": "16 April 2020",
        "main_body": "The US Navy has accused Iran's Islamic Revolution Guard Corps (IRGC) of dangerous and provocative actions in international waters in the Gulf. Eleven IRGC Navy vessels repeatedly conducted harassing approaches of six US Navy and Coast Guard ships on Wednesday, it said. One passed within 10 yards (9m) of a Coast Guard cutter.The US vessels were involved in a military exercise with US Army Apache attack helicopters.The incident came a day after armed men - believed to have been IRGC personnel - seized a Hong Kong-flagged tanker in the Gulf of Oman and redirected it into Iranian waters before releasing it.The US Navy said that during Wednesday's exercise the IRGC vessels crossed the bows and sterns of the US vessels at extremely close range and high speeds, including multiple crossings of the [USS Lewis B] Puller with a 50 yard closest point of approach and within 10 yards of [USCGC] Maui's bow.The US crews issued multiple warnings via bridge-to-bridge radio, five short blasts from the ships' horns and long-range acoustic noise maker devices, but received no response from the IRGCN.After approximately one hour, the IRGCN vessels responded to the bridge-to-bridge radio queries, then manoeuvred away from the US ships and opened distance between them, it added.The US Navy said such dangerous and provocative actions increased the risk of miscalculation and collision, and were not in accordance with international maritime conventions or customs. Last year, Iranian forces seized a British-flagged tanker in retaliation for the seizure of an Iranian tanker by the British territory of Gibraltar. Both vessels were eventually released.The US also accused Iran of carrying out attacks on six tankers in the Gulf of Oman and launching missiles and drones at two oil facilities in Saudi Arabia. Iran denied any involvement.Tensions between the US and Iran rose further in January, when the US killed a top IRGC general in a drone strike in Iraq. Iran responded by launching missiles at Iraqi military bases hosting US forces. Boris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    }
}