{
    "https://www.bbc.co.uk/news/uk-england-derbyshire-52488186": {
        "title": "Coronavirus: Village celebrates RAF veteran's 100th birthday",
        "date": "30 April 2020",
        "main_body": "Villagers held a surprise celebration for a man's 100th birthday after his celebration plans were halted by the coronavirus lockdown.RAF veteran Douglas Wall had hoped to mark the occasion with a meal at his local pub in Yeaveley, Derbyshire. Instead, residents surprised Mr Wall by singing Happy Birthday from outside their homes as he passed by on his mobility scooter.Resident Claire Williams described the centenarian as a real inspiration."
    },
    "https://www.bbc.co.uk/news/uk-52484185": {
        "title": "Captain Tom: RAF flypast in veteran's honour",
        "date": "30 April 2020",
        "main_body": "Two wartime RAF planes have flown over Captain Tom Moore's home to honour the war veteran and fundraiser on his 100th birthday.RAF Squadron Leader Mark Sugden told BBC reporter John Maguire what they were like to fly."
    },
    "https://www.bbc.co.uk/news/uk-scotland-north-east-orkney-shetland-52483027": {
        "title": "RAF chief condemns Russia over intercepted planes near Scotland",
        "date": "30 April 2020",
        "main_body": "The chief of Britain's air force has condemned its Russian counterpart after two of its maritime patrol bombers were intercepted north-east of Scotland.RAF Typhoon fighters were deployed from the Lossiemouth base in Moray as the Russian Tu-142 Bear-F aircraft approached on Wednesday.The Russian aircraft stayed in international airspace over the Norwegian Sea and the North Sea.However, the RAF said they were flying within the UK's area of interest.Norwegian F-16s and F-35 jets, and a NATO E-3A were also deployed to monitor the Russian planes, which were regarded as unidentified as they had not made radio contact with civilian or military Air Traffic Control, or filed a flight plan.Such flights by Russian air force planes are not uncommon. RAF jets were also scrambled twice in one week last month to monitor similar Tu-142 Bear aircraft.Chief of the Air Staff, Air Chief Marshal Mike Wigston, said the flights of the Cold War era Russian bombers contravened air traffic regulations.These Russian bombers are relics of the Cold War, do not comply with international air traffic regulations and are a hazard to civilian and military aircraft, he said.Boris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/programmes/b04kpdqf": {
        "title": "RAF Fighter Pilot",
        "date": "fail",
        "main_body": "Rhod Gilbert tries his hand at some proper jobs. In this edition he trains to become a pilot with the RAF, with an eye to co-piloting on an exercise.Stand-up comic Rhod Gilbert is doing another proper job and this time he is going supersonic as he trains to become a jet pilot with the RAF. The closest Rhod has got to a fighter jet before is watching Top Gun and his final challenge of co-piloting on an exercise is his toughest and most frightening ever work experience.            See all episodes from Rhod Gilbert's Work Experience        Follow comedian Rhod Gilbert as he tries out different jobs across Wales."
    },
    "https://www.bbc.co.uk/newsround/52459762": {
        "title": "Newsround",
        "date": "fail",
        "main_body": "Captain Tom Moore's 100th birthday will be marked by an RAF flypast.The special Battle of Britain Memorial Flight (BBMF) will carry out an aerial salute on Thursday April 30.The Ministry of Defence, who are responsible for the RAF, said the flypast would celebrate Captain Tom's birthday and mark his amazing fundraising achievement.Captain Tom is a war veteran has raised £27 million for the NHS so far by walking around his garden 100 times using a walking frame,  got to number one in the charts with a charity song and even got a personalised WWE title belt!The timing of the flight isn't being made public - to encourage people to follow social distancing and not to gather together to watch it.The Transport Secretary, Grant Shapps, said the RAF flypast meant Captain Tom would be honoured in an even more significant way.Ahead of his birthday, Captain Tom has already received more than 125,000 birthday cards!His grandson Benjie, who is 16, said: The volume of cards that have been sent to granddad is just astonishing. So many of the cards are truly heartfelt with thousands from young children who have taken the time to use their artistic talent and write a personal message.And some of the senders include Duke and Duchess of Cambridge, Dame Kelly Holmes and England football captain Harry Kane.The Royal Mail are also going to celebrate Captain Tom's birthday with a special postmark - it means all letters will be stamped with a special message until the day after his birthday. "
    },
    "https://www.bbc.co.uk/news/uk-england-beds-bucks-herts-52453194": {
        "title": "Coronavirus: RAF flypast for Captain Tom's 100th birthday",
        "date": "28 April 2020",
        "main_body": "Captain Tom Moore's 100th birthday will be marked with an RAF flypast, the transport secretary has announced.The war veteran, who has raised more than £29m for the NHS by walking laps of his garden, turns 100 on Thursday.The Department for Transport blocked an earlier plan for a flypast of his home organised by a Spitfire restoration firm, as it was deemed non-essential.Transport Secretary Grant Shapps wrote on Twitter that the RAF aerial salute was meant to be a surprise.The Ministry of Defence said the flypast would celebrate Captain Tom's birthday and mark his amazing fundraising achievement.It urged people to follow Captain Tom's disciplined example and not gather to watch the flypast but continue following guidelines on social distancing.Biggin Hill Heritage Hangar had organised a flypast involving a Mark IX Spitfire for Capt Tom's birthday, but on Monday it said it had been denied permission to complete the flight.Instead, its aircraft will fly on a circuit around Biggin Hill Airfield, near Croydon, to coincide with the weekly Clap for Carers event.The restoration company said the RAF Battle of Britain Memorial Flight - which is based at RAF Coningsby in Lincolnshire and includes six Spitfires - was not bound by the same restrictions on travel.Mr Shapps said the RAF flypast of Capt Tom's Bedfordshire home meant he would be honoured in an even more significant way.Bedfordshire's Police and Crime Commissioner, Kathryn Holloway, has warned people not to travel to visit Capt Tom in order to protect his health and safety.Meanwhile, a school attended by Capt Tom's grandson Benjie Ingram-Moore has been flooded with more than 125,000 cards from well-wishers across the globe.Famous names including the Duke and Duchess of Cambridge, Dame Kelly Holmes and England football captain Harry Kane have sent birthday cards for Capt Tom to Bedford School.Benjie turned to his school for help when he learned the Post Office was being swamped.Staff, parents and pupils spent hours opening each card and creating a display in the school's great hall.Benjie, 16, said: The volume of cards that have been sent to granddad is just astonishing. So many of the cards are truly heartfelt with thousands from young children who have taken the time to use their artistic talent and write a personal message.In another tribute to Capt Tom, all mail sent from Monday will be stamped with a special postmark in his honour.Royal portrait artist Darren Baker has also presented Capt Tom with a pastel portrait and a sketch of Keighley, West Yorkshire, where the 99-year-old grew up.Mr Baker, from Huddersfield, said: We chatted for ages about Yorkshire. He was over the moon - his smile is as warm as his heart. On Friday it was revealed he would be the first ever centenarian to top the charts, after his duet with Michael Ball went straight to number one.Their cover of You'll Never Walk Alone sold 82,000 copies, with proceeds going to the NHS Charities Together fund.Find BBC News: East of England on Facebook, Instagram and Twitter. If you have a story suggestion email eastofenglandnews@bbc.co.ukThe BBC is not responsible for the content of external Internet sitesBoris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/news/uk-scotland-52434776": {
        "title": "RAF flying coronavirus cover across Scotland",
        "date": "26 April 2020",
        "main_body": "RAF helicopters are providing cover to transfer coronavirus cases from across the whole of Scotland.The squadron of Pumas was deployed to Kinloss at the beginning of the outbreak. They have been training all over the country for weeks and are now fully operational."
    },
    "https://www.bbc.co.uk/news/uk-scotland-north-east-orkney-shetland-52424523": {
        "title": "Rise in illegal drone flying near RAF bases in Moray",
        "date": "25 April 2020",
        "main_body": "Drones have increasingly been flown illegally near two military bases in Moray, the RAF has said.Fight restriction zones are in place at RAF Lossiemouth and nearby Kinloss Barracks.Typhoon jets are stationed at Lossiemouth, and Kinloss currently has a unit of Puma helicopters to support the NHS during the lockdown.The recent good weather is suspected to be a reason for the increase in the use of drones.The RAF said a number of incidents had been reported to it, air traffic control and police, adding that people were likely to be breaking rules because they were unaware of the restriction zones.Typhoons are still being flown out of Lossiemouth for essential flights to maintain crews' training or in preparation for upcoming Nato operations.Former RAF station Kinloss is now an army barracks, but is also currently a base for three RAF Pumas which have been made available to the NHS for medical evacuations.Boris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/news/uk-england-northamptonshire-52397629": {
        "title": "Harry Dunn: RAF Croughton base probe into new car crash",
        "date": "23 April 2020",
        "main_body": "A US military base is looking into claims a staff member crashed while on the wrong side of the road close to where Harry Dunn was fatally wounded.Mr Dunn, 19, died in hospital after a crash outside RAF Croughton, which led to suspect Anne Sacoolas leaving the UK under diplomatic immunity.The latest incident is alleged to have seen a BMW veer off the road in Aynho, Northamptonshire, on Wednesday.Family spokesman Radd Seiger said the government is not safeguarding lives.Mrs Sacoolas claimed diplomatic immunity after the crash in August and returned to the US. She is suspected of causing the teenager's death by dangerous driving.The fresh claims come after pictures emerged of the black BMW, which is said to have crashed into a wall.Following Mr Dunn's death, Northamptonshire Police chief constable Nick Adderley said he would fund driver training at RAF Croughton in an attempt to prevent similar incidents.In January, Mr Adderley announced there had been two further incidents of US staff driving on the wrong side of the road after Mr Dunn's death.Mr Seiger said: What is it going to take before something is done?The loss of Harry Dunn was not enough. The near-misses since his death have not been enough. Will this disastrous crash tonight make any difference?The UK Government are failing in their duty to protect and safeguard our lives.He also branded the US government a disgrace for failing to engage with us at all to discuss how they are going to improve safety.The BBC is not responsible for the content of external Internet sitesBoris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    },
    "https://www.bbc.co.uk/news/technology-52381103": {
        "title": "Coronavirus: NHS contact-tracing app is tested at RAF base",
        "date": "22 April 2020",
        "main_body": "The NHS is testing its forthcoming Covid-19 contact-tracing app at a Royal Air Force base in North Yorkshire.It works by using Bluetooth signals to log when smartphone owners are close to each other - so if someone develops Covid-19 symptoms, an alert can be sent to other users they may have infected.In its current state, it tells users either: You're OK now, or: You need to isolate yourself and stay at home.The health secretary for England said the trials are going well.The more people who sign up for this new app when it goes live, the better informed our response will be and the better we can therefore protect the NHS, Matt Hancock told the House of Commons.He added the software would be used in conjunction with medical tests and manual contact tracing by humans.But some experts say the government may be putting too much faith in technology.We don't need fancy expensive apps where people are going to be exposed to issues of data privacy, Newcastle University Centre for Excellence in Regulatory Science director Prof Allyson Pollock told BBC News.We should be following... a low-tech model, using people and telephone [interviews].Clinical observation, we found in China and Singapore and Korea, is actually more efficient and gives many more positives.The NHS hopes to release the app by mid-May, although a final decision on timing will be taken by the government.RAF Leeming was chosen to host the trial of an early alpha version of the software because it has past experience of testing apps and other new processes on behalf of the military.It set up a scenario designed to simulate people's experience of going shopping, using Bluetooth LE (low energy) signals to log when two phones were near to each other.One of these phones would then be used to record the fact the user had become infected, in the experiment, causing a cascade of warnings to be sent to other handsets that had earlier been in range.We still have to apply the rules [on] social distancing as we carry it out, said Gp Capt Blythe Crawford.So therefore we've set up a scenario whereby people will leave their phones on a table simulating that it's in a shopping arcade, for example, whilst other people might walk past looking in the shop window and their phone happens to pick up it's in proximity to another one.The on-screen warning for those deemed to be at risk says: If you're on public transport, go home by the most direct route [and] stay at least 2m [6.6ft] away from people if you can... find a room where you can close the door [and] avoid touching people, surfaces and objects.There are plans for a more realistic follow-up beta test at a later date - possibly in a remote community, where its use would be voluntary - by which time the text will have been changed.The tool has been developed by the health service's digital innovation unit, NHSX.It has said the alerts will be sent anonymously, so users will not be told who triggered a warning. NHSX has also promised to publish its key security and privacy designs as well as the app's source code, so experts in the field can help ensure it is world class.The division is working with Apple and Google on the project but has yet to confirm whether it will adopt their protocols.The two companies are pressing developers to adopt a decentralised approach, whereby it would be impossible for either specific users or those they had come into contact with to be identified by the authorities or any other external party.In any case, NHSX believes its system already prevents it from being able to identify users until they request a swab test.NHSX also believes it has found a way to ensure its software continues to work in the background on iOS devices.If true, this would avoid a problem that has limited take-up of a similar app in Singapore.Epidemiologists have said 80% of smartphone owners need to use the app if it is to suppress, rather than just slow, the spread of the virus after lockdown measures are relaxed.But as about 12% of smartphones in active use in the UK do not support the Bluetooth LE standard required, the target figure will actually be higher.And the government is examining ways to increase involvement. One option under consideration is to provide low-cost wearable Bluetooth devices to those without a compatible handset. A similar scheme is already being trialled in Bulgaria to keep track of people quarantined during the coronavirus pandemic.Boris Johnson will lead the Downing Street briefing later for the first time since his return to work."
    }
}